using System;
using System.Drawing;

namespace Телега.Графические_объекты
{
    class Квадрат : Точка, Графический_объект
    {
        /// <summary>
        /// Длина стороны квадрата
        /// </summary>
        protected double Размер;
        /// <summary>
        /// Массив сторон квадрата
        /// </summary>
        public Линия[] Стороны;
        /// <summary>
        /// Создает экземпляр квадрата
        /// </summary>
        /// <param name="родитель">Панель для доступа к ее высоте панели, поверхности и параметрам поворота</param>
        /// <param name="центр_X">X координата центра квадрата</param>
        /// <param name="центр_Y">Y координата центра квадрата</param>
        /// <param name="размер">Длина стороны квадрата</param>
        /// <param name="цвет">Цвет квадрата</param>
        public Квадрат(Область_построения родитель, double центр_X, double центр_Y, double размер, Color цвет) : base(родитель, центр_X, центр_Y, цвет)
        {
            this.Размер = размер;
            this.Стороны = new Линия[4];
            this.Стороны[0] = new Линия(родитель, центр_X - размер / 2, центр_Y - размер / 2, центр_X + размер / 2, центр_Y - размер / 2, цвет);
            this.Стороны[1] = new Линия(родитель, центр_X + размер / 2, центр_Y - размер / 2, центр_X + размер / 2, центр_Y + размер / 2, цвет);
            this.Стороны[2] = new Линия(родитель, центр_X + размер / 2, центр_Y + размер / 2, центр_X - размер / 2, центр_Y + размер / 2, цвет);
            this.Стороны[3] = new Линия(родитель, центр_X - размер / 2, центр_Y + размер / 2, центр_X - размер / 2, центр_Y - размер / 2, цвет);
        }
        /// <summary>
        /// Метод поворачивает квадрат воокруг заданной оси
        /// </summary>
        /// <param name="x">X координата оси поворота</param>
        /// <param name="y">Y координата оси поворота</param>
        public override void Повернуть(double x, double y)
        {
            foreach (Линия линия in this.Стороны)
                линия.Повернуть(x, y);
            base.Повернуть(x, y);
        }
        /// <summary>
        /// Рисует квадрат на поверхности рисования gr
        /// </summary>
        /// <param name="gr">Поверхность рисования</param>
        public override void Нарисовать(ref Graphics gr)
        {
            foreach (Линия линия in this.Стороны)
            {
                линия.Нарисовать(ref gr);
            }
        }
    }
}
