using System;
using System.Drawing;

namespace Телега.Графические_объекты
{
    class Квадрат : Точка, Графический_объект
    {
        protected double Размер;
        public Линия[] Стороны;
        public Точка[] Вершины;
        public Квадрат(double центр_X, double центр_Y, double размер, Color цвет) : base(центр_X, центр_Y, цвет)
        {
            this.Размер = размер;
            this.Стороны = new Линия[4];
            this.Стороны[0] = new Линия(центр_X - размер / 2, центр_Y - размер / 2, центр_X + размер / 2, центр_Y - размер / 2, цвет);
            this.Стороны[1] = new Линия(центр_X + размер / 2, центр_Y - размер / 2, центр_X + размер / 2, центр_Y + размер / 2, цвет);
            this.Стороны[2] = new Линия(центр_X + размер / 2, центр_Y + размер / 2, центр_X - размер / 2, центр_Y + размер / 2, цвет);
            this.Стороны[3] = new Линия(центр_X - размер / 2, центр_Y + размер / 2, центр_X - размер / 2, центр_Y - размер / 2, цвет);
            this.Вершины = new Точка[4];
            this.Вершины[0] = new Точка(центр_X - размер / 2, центр_Y - размер / 2, цвет);
            this.Вершины[1] = new Точка(центр_X + размер / 2, центр_Y - размер / 2, цвет);
            this.Вершины[2] = new Точка(центр_X + размер / 2, центр_Y + размер / 2, цвет);
            this.Вершины[3] = new Точка(центр_X - размер / 2, центр_Y + размер / 2, цвет);
        }
        public void Повернуть(double x, double y)
        {
            foreach (Линия линия in this.Стороны)
                линия.Повернуть(x, y);
            foreach (Точка точка in this.Вершины)
                точка.Повернуть(x, y);
            base.Повернуть(x, y);
        }
        public void Нарисовать(ref Graphics gr)
        {
            foreach (Линия линия in this.Стороны)
            {
                линия.Нарисовать(ref gr);
            }
        }
    }
}
