using System;
using System.Drawing;

namespace Телега.Графические_объекты
{
    public struct Параметры
    {
        public Color Цвет_левого_колеса;
        public int Размер_левого_колеса;
        public Color Цвет_правого_колеса;
        public int Размер_правого_колеса;
        public Color Цвет_телеги;
        public int Длина_телеги;            // Расстояние между колесами
        public int Высота_телеги;
        public double Скорость_движения;    // В градусах
        public int Смещение_по_Y;
        public static void Стандартные(ref Параметры параметры)                  // Стандартные значения
        {
            параметры.Цвет_левого_колеса = Color.Red;
            параметры.Размер_левого_колеса = 25;
            параметры.Цвет_правого_колеса = Color.Red;
            параметры.Размер_правого_колеса = 50;
            параметры.Цвет_телеги = Color.Green;
            параметры.Длина_телеги = 100;
            параметры.Высота_телеги = 50;
            параметры.Скорость_движения = 1;
            параметры.Смещение_по_Y = 40;
        }
    }
}
