using System;
using System.Drawing;

namespace Телега.Графические_объекты
{
    struct Квадрат
    {
        public Линия[] Стороны;
        public Точка Центр;
        public static void Установить_значения(ref Квадрат квадрат, double центр_X, double центр_Y, double размер, Color цвет)
        {
            Точка.Установить_значения(ref квадрат.Центр, центр_X, центр_Y, цвет);
            квадрат.Стороны = new Линия[4];
            Линия.Установить_значения(ref квадрат.Стороны[0], центр_X - размер / 2, центр_Y - размер / 2, центр_X + размер / 2, центр_Y - размер / 2, цвет);
            Линия.Установить_значения(ref квадрат.Стороны[1], центр_X + размер / 2, центр_Y - размер / 2, центр_X + размер / 2, центр_Y + размер / 2, цвет);
            Линия.Установить_значения(ref квадрат.Стороны[2], центр_X + размер / 2, центр_Y + размер / 2, центр_X - размер / 2, центр_Y + размер / 2, цвет);
            Линия.Установить_значения(ref квадрат.Стороны[3], центр_X - размер / 2, центр_Y + размер / 2, центр_X - размер / 2, центр_Y - размер / 2, цвет);
        }
        public static void Повернуть(ref Квадрат квадрат, Область_построения область_построения, double x, double y)
        {
            for(int i=0; i<4; i++)
                Линия.Повернуть(ref квадрат.Стороны[i], область_построения, x, y);
            Точка.Повернуть(ref квадрат.Центр, область_построения, x, y);
        }
        public static void Нарисовать(Квадрат квадрат, Область_построения область_построения, ref Graphics gr)
        {
            foreach (Линия линия in квадрат.Стороны)
            {
                Линия.Нарисовать(линия, область_построения, ref gr);
            }
        }
    }
}
